In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("Supermarket Sales 2.csv")   # read CSV

In [4]:
# df.to_excel("Car_sales.xlsx", index=False)
# df = pd.read_excel("Car_sales.xlsx" ,sheet_name="main")

In [5]:
df

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
0,1/1/2024,Brooklyn,Member,Female,Food & Beverages,84.63,10,Credit card,9.0
1,1/1/2024,Queens,Normal,Female,Electronics,63.22,2,Cash,8.5
2,1/1/2024,Brooklyn,Normal,Female,Electronics,74.71,6,Cash,6.7
3,1/1/2024,Queens,Member,Female,Sports & Travel,36.98,10,Credit card,7.0
4,1/1/2024,Manhattan,Member,Female,Sports & Travel,27.04,4,Ewallet,6.9
...,...,...,...,...,...,...,...,...,...
5048,12/31/2024,Manhattan,Normal,Female,Food & Beverages,6.71,10,Cash,5.9
5049,12/31/2024,Brooklyn,Normal,Male,Food & Beverages,6.79,9,Credit card,4.8
5050,12/31/2024,Queens,Member,Male,Electronics,85.05,7,Ewallet,4.4
5051,12/31/2024,Manhattan,Member,Female,Sports & Travel,54.64,10,Credit card,4.8
5052,12/31/2024,Queens,Normal,Female,Health & Beauty,49.75,7,Cash,5.8

In [6]:
df.head() # first 5 values are given when arrguments are given

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
0,1/1/2024,Brooklyn,Member,Female,Food & Beverages,84.63,10,Credit card,9.0
1,1/1/2024,Queens,Normal,Female,Electronics,63.22,2,Cash,8.5
2,1/1/2024,Brooklyn,Normal,Female,Electronics,74.71,6,Cash,6.7
3,1/1/2024,Queens,Member,Female,Sports & Travel,36.98,10,Credit card,7.0
4,1/1/2024,Manhattan,Member,Female,Sports & Travel,27.04,4,Ewallet,6.9

In [7]:
df.head(10)# first 10 values are given

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
0,1/1/2024,Brooklyn,Member,Female,Food & Beverages,84.63,10,Credit card,9.0
1,1/1/2024,Queens,Normal,Female,Electronics,63.22,2,Cash,8.5
2,1/1/2024,Brooklyn,Normal,Female,Electronics,74.71,6,Cash,6.7
3,1/1/2024,Queens,Member,Female,Sports & Travel,36.98,10,Credit card,7.0
4,1/1/2024,Manhattan,Member,Female,Sports & Travel,27.04,4,Ewallet,6.9
5,1/1/2024,Manhattan,Normal,Female,Fashion & Accs,65.74,9,Cash,7.7
6,1/1/2024,Manhattan,Member,Male,Home & Lifestyle,47.59,8,Cash,5.7
7,1/1/2024,Manhattan,Normal,Male,Sports & Travel,72.61,6,Credit card,6.9
8,1/1/2024,Queens,Normal,Male,Health & Beauty,62.87,2,Cash,5.0
9,1/1/2024,Brooklyn,Normal,Male,Food & Beverages,21.12,8,Cash,6.3

In [8]:
df.tail() #last 5 value are given when arrguments are given

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
5048,12/31/2024,Manhattan,Normal,Female,Food & Beverages,6.71,10,Cash,5.9
5049,12/31/2024,Brooklyn,Normal,Male,Food & Beverages,6.79,9,Credit card,4.8
5050,12/31/2024,Queens,Member,Male,Electronics,85.05,7,Ewallet,4.4
5051,12/31/2024,Manhattan,Member,Female,Sports & Travel,54.64,10,Credit card,4.8
5052,12/31/2024,Queens,Normal,Female,Health & Beauty,49.75,7,Cash,5.8

In [9]:
df.tail(10) #last 10 value are given

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
5043,12/31/2024,Brooklyn,Member,Female,Sports & Travel,71.73,6,Credit card,7.1
5044,12/31/2024,Manhattan,Member,Female,Electronics,73.14,4,Ewallet,8.8
5045,12/31/2024,Manhattan,Member,Male,Health & Beauty,25.32,10,Ewallet,3.3
5046,12/31/2024,Queens,Member,Male,Home & Lifestyle,59.64,3,Ewallet,6.7
5047,12/31/2024,Queens,Normal,Female,Electronics,80.72,1,Ewallet,6.6
5048,12/31/2024,Manhattan,Normal,Female,Food & Beverages,6.71,10,Cash,5.9
5049,12/31/2024,Brooklyn,Normal,Male,Food & Beverages,6.79,9,Credit card,4.8
5050,12/31/2024,Queens,Member,Male,Electronics,85.05,7,Ewallet,4.4
5051,12/31/2024,Manhattan,Member,Female,Sports & Travel,54.64,10,Credit card,4.8
5052,12/31/2024,Queens,Normal,Female,Health & Beauty,49.75,7,Cash,5.8

In [10]:
df.sample() # random data given from whole data

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
241,1/23/2024,Manhattan,Member,Male,Food & Beverages,98.53,6,Credit card,4.0

In [11]:
df.sample(10)

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
2542,7/20/2024,Brooklyn,Normal,Female,Food & Beverages,6.93,2,Credit card,7.2
4052,11/7/2024,Queens,Normal,Female,Food & Beverages,2.12,10,Credit card,9.1
1453,4/30/2024,Brooklyn,Normal,Female,Health & Beauty,56.69,9,Credit card,8.4
2397,7/9/2024,Queens,Member,Female,Health & Beauty,28.49,4,Ewallet,7.0
1411,4/26/2024,Queens,Normal,Female,Food & Beverages,48.61,1,Cash,4.4
2168,6/22/2024,Brooklyn,Member,Female,Health & Beauty,18.15,3,Cash,8.5
716,3/4/2024,Manhattan,Member,Male,Health & Beauty,48.63,10,Cash,8.8
3207,9/9/2024,Queens,Normal,Male,Health & Beauty,37.72,9,Credit card,7.6
906,3/20/2024,Manhattan,Normal,Male,Food & Beverages,43.25,2,Cash,6.2
1662,5/14/2024,Brooklyn,Normal,Male,Food & Beverages,27.66,5,Ewallet,8.3

In [12]:
df.isna() # missing value handle

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
5048,False,False,False,False,False,False,False,False,False
5049,False,False,False,False,False,False,False,False,False
5050,False,False,False,False,False,False,False,False,False
5051,False,False,False,False,False,False,False,False,False
5052,False,False,False,False,False,False,False,False,False

In [13]:
df.isna().sum() # missing value handle

Date             0
Branch           0
Customer type    0
Gender           0
Product line     0
Unit price       0
Quantity         0
Payment          0
Rating           0
dtype: int64

- here datetime formate but we have seperated file for it

In [14]:
df.isnull().sum()

Date             0
Branch           0
Customer type    0
Gender           0
Product line     0
Unit price       0
Quantity         0
Payment          0
Rating           0
dtype: int64

In [15]:
df

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
0,1/1/2024,Brooklyn,Member,Female,Food & Beverages,84.63,10,Credit card,9.0
1,1/1/2024,Queens,Normal,Female,Electronics,63.22,2,Cash,8.5
2,1/1/2024,Brooklyn,Normal,Female,Electronics,74.71,6,Cash,6.7
3,1/1/2024,Queens,Member,Female,Sports & Travel,36.98,10,Credit card,7.0
4,1/1/2024,Manhattan,Member,Female,Sports & Travel,27.04,4,Ewallet,6.9
...,...,...,...,...,...,...,...,...,...
5048,12/31/2024,Manhattan,Normal,Female,Food & Beverages,6.71,10,Cash,5.9
5049,12/31/2024,Brooklyn,Normal,Male,Food & Beverages,6.79,9,Credit card,4.8
5050,12/31/2024,Queens,Member,Male,Electronics,85.05,7,Ewallet,4.4
5051,12/31/2024,Manhattan,Member,Female,Sports & Travel,54.64,10,Credit card,4.8
5052,12/31/2024,Queens,Normal,Female,Health & Beauty,49.75,7,Cash,5.8

In [16]:
df.dropna(inplace=True)  # original data formate change ---> for missing value handle

In [17]:
df

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
0,1/1/2024,Brooklyn,Member,Female,Food & Beverages,84.63,10,Credit card,9.0
1,1/1/2024,Queens,Normal,Female,Electronics,63.22,2,Cash,8.5
2,1/1/2024,Brooklyn,Normal,Female,Electronics,74.71,6,Cash,6.7
3,1/1/2024,Queens,Member,Female,Sports & Travel,36.98,10,Credit card,7.0
4,1/1/2024,Manhattan,Member,Female,Sports & Travel,27.04,4,Ewallet,6.9
...,...,...,...,...,...,...,...,...,...
5048,12/31/2024,Manhattan,Normal,Female,Food & Beverages,6.71,10,Cash,5.9
5049,12/31/2024,Brooklyn,Normal,Male,Food & Beverages,6.79,9,Credit card,4.8
5050,12/31/2024,Queens,Member,Male,Electronics,85.05,7,Ewallet,4.4
5051,12/31/2024,Manhattan,Member,Female,Sports & Travel,54.64,10,Credit card,4.8
5052,12/31/2024,Queens,Normal,Female,Health & Beauty,49.75,7,Cash,5.8

In [18]:
df.isna().sum()

Date             0
Branch           0
Customer type    0
Gender           0
Product line     0
Unit price       0
Quantity         0
Payment          0
Rating           0
dtype: int64

In [19]:
df["Customer type"] = df["Customer type"].fillna("-")  # for missing value replace by(-)

In [20]:
df

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
0,1/1/2024,Brooklyn,Member,Female,Food & Beverages,84.63,10,Credit card,9.0
1,1/1/2024,Queens,Normal,Female,Electronics,63.22,2,Cash,8.5
2,1/1/2024,Brooklyn,Normal,Female,Electronics,74.71,6,Cash,6.7
3,1/1/2024,Queens,Member,Female,Sports & Travel,36.98,10,Credit card,7.0
4,1/1/2024,Manhattan,Member,Female,Sports & Travel,27.04,4,Ewallet,6.9
...,...,...,...,...,...,...,...,...,...
5048,12/31/2024,Manhattan,Normal,Female,Food & Beverages,6.71,10,Cash,5.9
5049,12/31/2024,Brooklyn,Normal,Male,Food & Beverages,6.79,9,Credit card,4.8
5050,12/31/2024,Queens,Member,Male,Electronics,85.05,7,Ewallet,4.4
5051,12/31/2024,Manhattan,Member,Female,Sports & Travel,54.64,10,Credit card,4.8
5052,12/31/2024,Queens,Normal,Female,Health & Beauty,49.75,7,Cash,5.8

In [21]:
#df["Unit price"].fillna(df["Unit price"].mean(),inplace = True) --->this is change in version 3.0

In [22]:
df.isna().sum()

Date             0
Branch           0
Customer type    0
Gender           0
Product line     0
Unit price       0
Quantity         0
Payment          0
Rating           0
dtype: int64

In [ ]:
df.duplicated() # for copy is available or not to check

0       False
1       False
2       False
3       False
4       False
        ...
5048    False
5049    False
5050    False
5051    False
5052    False
Length: 5053, dtype: bool

In [24]:
print(df.duplicated().sum())

0

In [25]:
df.drop_duplicates(inplace=True) # for change

In [26]:
df.duplicated().sum()

np.int64(0)

In [27]:
df.dtypes

Date              object
Branch            object
Customer type     object
Gender            object
Product line      object
Unit price       float64
Quantity           int64
Payment           object
Rating           float64
dtype: object